mysource/public-notes-org/2023-09-19-custom-lists-in-org-mode-beamer.org
#+TITLE: Custom (per slide) list environments in beamer
#+DESCRIPTION: 
#+AUTHOR: cissic
#+DATE: <2023-09-19 Tue>
#+TAGS: org-mode beamer itemize enumerate 
# #+OPTIONS: toc:nil
#+OPTIONS: -:nil



* TODO {{{title}}}
:PROPERTIES:
:PRJ-DIR: ./2023-09-19-org-mode-beamer-lists/
:END:

** Example of an org-mode/beamer document where list fonts should be customized per slide or per list

#+begin_src org :tangle (concat (org-entry-get nil "PRJ-DIR" t) "beam_ex.org") :mkdirp yes
  ,#+latex_class: beamer
  ,#+OPTIONS: H:2
  ,#+beamer_header: \setbeamertemplate{itemize item}[circle]
  ,#+beamer_header: \setbeamertemplate{itemize subitem}[square]

  # #+beamer_header: \setbeamerfont{itemize/enumerate body}{size=\footnotesize}
  ,#+beamer_header: \setbeamerfont{itemize/enumerate subbody}{size=\scriptsize}


  ,* Section 1
  ,** Frame 1
    - item 1
    - item 2
    - @@latex:[\Large $\bullet$] \tiny@@ change per item [[https://emacs.stackexchange.com/questions/35976/how-to-change-the-appearance-of-list-bullets-in-latex-beamer-exports][link]]
      1. item A
      2. item B

  ,#+begin_export beamer
  % \tiny
  % \setbeamerfont{itemize/enumerate body}{size=\size}
  \setbeamerfont{itemize/enumerate body}{size=\tiny}
  \setbeamerfont{itemize/enumerate subbody}{size=\Large}
  
  \setbeamercolor{itemize/enumerate body}{fg=red}
  \setbeamercolor{itemize/enumerate subbody}{fg=green}
  \setbeamercolor{itemize/enumerate subsubbody}{fg=blue}
  
  % \setbeamertemplate{enumerate items}[square]
  \setbeamertemplate{enumerate items}[square]
  \setbeamertemplate{itemize items}[square]
  ,#+end_export

    - item 1
    - item 2
      1. item A
      2. item B


  ,* Section 2
  ,** Frame 2
  
    - item 1
    - item 2
      1. item A
      2. item B

  ,#+begin_export beamer
  % \tiny
  % \setbeamerfont{itemize/enumerate body}{size=\size}
  \setbeamerfont{itemize/enumerate body}{size=\tiny}
  \setbeamerfont{itemize/enumerate subbody}{size=\Large}
  % \setbeamertemplate{enumerate items}[square]
  
  \setbeamertemplate{itemize items}{\color{red}$\blacktriangleright$}
  ,#+end_export
  
    - item 1
    - item 2
      1. item A
      2. item B

#+end_src


* COMMENT Local Variables

# Local Variables:
# eval: (add-hook 'org-export-before-processing-hook 
# 'my/org-export-markdown-hook-function nil t)
# End:

